TITLE LAB3
;---------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:  Створити двовимірний масив array2Db, що складається з елементів в один байт,
; має розмір 16х16. Записати на діагональ масиву ініціали студентів групи.
; ВУЗ: 			КНУУ КПІ
; Факультет: 	ФІОТ
; Курс: 		1
; Група:		ІТ-03
;---------------------------------------------------------------
; Автори: Дудченко, Цуканова, Бублик
; Дата: 18.03.2021

;---------------------------ЗАГОЛОВОК ПРОГРАМИ------------------

	IDEAL			; Директива - тип Асемблера tasm
	MODEL small		; Директива - тип моделі пам'яті
	STACK 512		; Директива - розмір стеку в байтах

;---------------------------МАКРОСИ-----------------------------
; макрос для ініціалізації
MACRO M_Init 		; Початок макросу
	mov ax,@data 	; ax <- @data
	mov ds,ax 		; ds <- ax
	mov es,ax 		; es <- ax
ENDM M_Init 		; Кінець макросу

; макрос для автоматизації процесу інкременту та додавання до значення базового регістру
MACRO M_Increment
	inc si ; збільшуємо si на 1, для пересування по горизонталі
	add bx, 10h ; збільшуємо bx на 10, для пересування по вертикалі
ENDM M_Increment	
;---------------------------ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------

DATASEG
;Оголошення двовимірного масиву 16х16
	array2Db	db  7, 8, 7, 8, 7, 8, 7, 8, 7, 8, 7, 8, 7, 8, 7, 8
			db  8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db  7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db  8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db  7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db  8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db  7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db  8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db	7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db	8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db	7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db	8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db	7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7
			db	8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8
			db	7, 8, 7, 8, 7, 8, 7, 8, 0, 8, 7, 8, 7, 8, 7, 7
			
	exCode db 0  		; Код виходу

;----------------------IV. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
CODESEG
	Start:
	M_Init					
	; використовуємо макрос
;-------------------------Ініціалізація DS і ES--------------------
	mov ax, @data ; @data ідентифікатор, що створюється директивою model
	mov ds, ax 	; Завантаження початку сегменту даних в регістр ds 
	mov es, ax ; Завантаження початку сегменту даних в регістр es
	mov si, 00h ; Індексний регістр пересування по горизонталі
	mov bx, 70h ; Базовий регістр пересування по вертикалі 
	
	mov al, 044h 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 041h 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 041h 			
	mov [array2Db+bx+si], al
	M_Increment				
;------------------------------------------------------------------

	mov al, 054h 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 04Dh 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 053h 			
	mov [array2Db+bx+si], al
	M_Increment				
;------------------------------------------------------------------

	mov al, 042h 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 049h 			
	mov [array2Db+bx+si], al
	M_Increment				
	mov al, 056h 			
	mov [array2Db+bx+si], al
	M_Increment					

;-------------------------Вихід з програми-------------------------
	mov ah, 4ch
	mov al, [exCode] ; отримання коду виходу
	int 21h ; виклик функції DOS 4ch
	end Start
