TITLE ЛР_4 
;------------------------------------------------------------------------------
;ЛР  №4
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-03
;------------------------------------------------------------------------------
; Автор:        Дудченко Цуканова Бублик
; Дата:         12.03.2021
;---------------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 2048		; Директива - розмір стеку  

DATASEG
arr_stack   dw 2E2Eh, 2098, 6847, 7230, 5182, 1964, 7350, 1628, 9823, 5927, 2343, 7515, 5238, 8272, 6576, 2619
            dw 9520, 6608, 5535, 9745, 8314, 1683, 2065, 3718, 3198, 5267, 1546, 2273, 9317, 2181, 7466, 1940
            dw 7417, 2385 ,2240 ,8346, 9246, 9573, 5050, 1549, 4402, 7854 ,8126 ,9060 ,3476 ,7497 ,3703, 1857
            dw 8794, 8017, 3227, 1033, 7980, 8658, 6475, 2653, 4970, 3343, 3788, 4600, 4953, 5156 ,7128, 9539
            dw 4889, 8734 ,8685 ,3104 ,5514 ,9721 ,5958 ,4611 ,7759 ,1725, 6059 ,7499 ,9681 ,4573 ,6929 ,1387
            dw 2772, 5484 ,7392 ,8250 ,5503 ,6080 ,1249, 3413, 3167, 9250 ,7496 ,7533 ,2101, 4007, 6810, 4531
            dw 4979, 9050, 8589, 6962, 5374 ,3451 ,2971, 6612, 8002, 4074, 2634, 3694, 7979, 7571 ,7333, 9852
            dw 9847, 3270 ,2426 ,6722, 2697 ,9765 ,2203 ,3222 ,6819 ,5024 ,5846 ,3619 ,9626 ,2638 ,4465, 2E2Eh
            ; dw 6168, 4225 ,1734 ,1704, 5950, 9829, 8679, 9617, 8396, 4940, 5732, 6701 ,3166 ,2616, 6987, 8377
            ; dw 7688, 7111 ,1276 ,2132 ,7324, 2896 ,5471 ,9746 ,4446, 8631, 3823 ,4104, 1703, 5118, 8162 ,6956
            ; dw 5078, 8971, 4420, 2751, 2263, 4606, 5018, 4659, 9125, 5998, 4151, 1151, 3821, 4828, 7659, 7950
            ; dw 7775, 7780 ,5945 ,8680, 7858 ,9097 ,1380, 4009 ,4839 ,2852 ,9426, 3437 ,4798, 6011 ,3989 ,8238
            ; dw 2335, 6148, 5282, 9208, 9920, 9193, 1070, 3233, 6084, 3442, 3539, 9784, 3311, 6448, 6268, 3076
            ; dw 7425, 8226 ,4648, 1585 ,6491 ,1032 ,7524 ,6707 ,7598 ,3981, 4432 ,2127 ,7683 ,4272 ,1919 ,8056
            ; dw 6988, 4592, 4203, 6912, 4949, 4763, 5163, 3761, 4098, 6591, 6327, 3811, 6427, 7300, 2349 ,7645
            ; dw 1514, 1055, 8644 ,9563, 2705, 8004, 4173, 7621, 1481 ,7822, 6364, 1598, 8556, 1438, 5523, 1968

birthday db "11.06 04.07 24.07"        

CODESEG
Start:
    mov ax, @data ; ініціалізація сегменту коду
    mov ds, ax    ; ax -> ds
    mov es, ax    ; ax -> es

    mov cx, 128   ; кількість повторів, копіюємо по 2 байти - 64 машинних слова
	;------------------------------- копіюємо масив --------------------------------
	xor si, si                           ; обнуляємо значення si
        array_copy:                      ; цикл для копіювання масиву
            mov bx, [ds:si]              ; отримуємо кількість елементів arr_stack та задаємо її до bx як змінну
            mov [ds:[si+130h]], bx		 ; занесення до сегменту даних
			mov [ds:[si+240h]], bx
			mov [ds:[si+350h]], bx
			mov [ds:[si+460h]], bx
			mov [ds:[si+570h]], bx
			mov [ds:[si+680h]], bx
			mov [ds:[si+790h]], bx	 
            add si, 2                    ; збільшуємо значення в регістрі si на 2, оскільки було записано два байти
            loop array_copy				 ; перевірка циклу

	;----------------------розраховуємо розмір стеку для розміщення масиву-------------
	; мінімальний розмір стеку = розмір масиву
	; отже 256 значень = 256 байтів

    mov cx, 128                 		 ; кількість повторів, копіюємо по 2 байти - 64 машинних слова 
	xor si, si                       	 ; обнуляємо значення si
        push_to_stack:
            mov ax,[ds:[si]]             ; заносимо значення з ділянки ds до ax
            push ax                      ; заносимо значення ax до стеку
            add si, 2                    ; збільшуємо значення в регістрі si на 2, оскільки було записано два байти
            loop push_to_stack			 ; перевірка циклу

   
	;-----------------------додаємо дні народження до стеку -------------------------------
	; розмір стеку = 2048 = 0800h, в нього записано 256 байтів (0100h)
	; отже покажчик sp стоїть на 0700h => восьмий рядок стоъть на ss: 0770h
    
	mov bp, 0770h						; адреса
	xor si,si							; обнуляємо значення si
	mov cx, 17     						; кількість повторів
	birthday_add:
		mov ah, [birthday+si]          	 ; вказуємо вивід
		mov [bp], ah                     ; додаємо значення у стек
		inc si                           ; інкрементуємо si
		inc bp                           ; інкрементуємо bp
		loop birthday_add

	;------------------------
	mov ax, @stack
	
    mov ah, 4ch							
    int 21h 							; виклик функції DOS 4ch

end Start